IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G1_EPWM30_CONTROLSS_G1_EPWM30.xml
	<register id="CONTROLSS_G1_EPWM30_XREGSHDW1STS" acronym="CONTROLSS_G1_EPWM30_XREGSHDW1STS" offset="0x420" width="32" description="Shadow Buffer 1 Update Status Register">
		<bitfield id="XMIN_SHDW1FULL" width="1" begin="14" end="14" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="14" rwaccess="R"/> 
		<bitfield id="XMAX_SHDW1FULL" width="1" begin="13" end="13" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="13" rwaccess="R"/> 
		<bitfield id="XAQCTLB_SHDW1FULL" width="1" begin="12" end="12" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="12" rwaccess="R"/> 
		<bitfield id="XAQCTLA_SHDW1FULL" width="1" begin="11" end="11" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="11" rwaccess="R"/> 
		<bitfield id="CMPD_SHDW1FULL" width="1" begin="10" end="10" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="10" rwaccess="R"/> 
		<bitfield id="CMPC_SHDW1FULL" width="1" begin="9" end="9" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="9" rwaccess="R"/> 
		<bitfield id="XTBPRD_SHDW1FULL" width="1" begin="8" end="8" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="8" rwaccess="R"/> 
		<bitfield id="XCMP8_SHDW1FULL" width="1" begin="7" end="7" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="7" rwaccess="R"/> 
		<bitfield id="XCMP7_SHDW1FULL" width="1" begin="6" end="6" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="6" rwaccess="R"/> 
		<bitfield id="XCMP6_SHDW1FULL" width="1" begin="5" end="5" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="5" rwaccess="R"/> 
		<bitfield id="XCMP5_SHDW1FULL" width="1" begin="4" end="4" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="4" rwaccess="R"/> 
		<bitfield id="XCMP4_SHDW1FULL" width="1" begin="3" end="3" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="3" rwaccess="R"/> 
		<bitfield id="XCMP3_SHDW1FULL" width="1" begin="2" end="2" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="2" rwaccess="R"/> 
		<bitfield id="XCMP2_SHDW1FULL" width="1" begin="1" end="1" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="1" rwaccess="R"/> 
		<bitfield id="XCMP1_SHDW1FULL" width="1" begin="0" end="0" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="0" rwaccess="R"/>
	</register>
	<register id="CONTROLSS_G1_EPWM30_XREGSHDW2STS" acronym="CONTROLSS_G1_EPWM30_XREGSHDW2STS" offset="0x428" width="32" description="Shadow Buffer 2 Update Status Register">
		<bitfield id="XMIN_SHDW2FULL" width="1" begin="14" end="14" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="14" rwaccess="R"/> 
		<bitfield id="XMAX_SHDW2FULL" width="1" begin="13" end="13" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="13" rwaccess="R"/> 
		<bitfield id="XAQCTLB_SHDW2FULL" width="1" begin="12" end="12" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="12" rwaccess="R"/> 
		<bitfield id="XAQCTLA_SHDW2FULL" width="1" begin="11" end="11" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="11" rwaccess="R"/> 
		<bitfield id="CMPD_SHDW2FULL" width="1" begin="10" end="10" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="10" rwaccess="R"/> 
		<bitfield id="CMPC_SHDW2FULL" width="1" begin="9" end="9" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="9" rwaccess="R"/> 
		<bitfield id="XTBPRD_SHDW2FULL" width="1" begin="8" end="8" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="8" rwaccess="R"/> 
		<bitfield id="XCMP8_SHDW2FULL" width="1" begin="7" end="7" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="7" rwaccess="R"/> 
		<bitfield id="XCMP7_SHDW2FULL" width="1" begin="6" end="6" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="6" rwaccess="R"/> 
		<bitfield id="XCMP6_SHDW2FULL" width="1" begin="5" end="5" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="5" rwaccess="R"/> 
		<bitfield id="XCMP5_SHDW2FULL" width="1" begin="4" end="4" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="4" rwaccess="R"/> 
		<bitfield id="XCMP4_SHDW2FULL" width="1" begin="3" end="3" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="3" rwaccess="R"/> 
		<bitfield id="XCMP3_SHDW2FULL" width="1" begin="2" end="2" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="2" rwaccess="R"/> 
		<bitfield id="XCMP2_SHDW2FULL" width="1" begin="1" end="1" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="1" rwaccess="R"/> 
		<bitfield id="XCMP1_SHDW2FULL" width="1" begin="0" end="0" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="0" rwaccess="R"/>
	</register>
	<register id="CONTROLSS_G1_EPWM30_XREGSHDW3STS" acronym="CONTROLSS_G1_EPWM30_XREGSHDW3STS" offset="0x430" width="32" description="Shadow Buffer 3 Update Status Register">
		<bitfield id="XMIN_SHDW3FULL" width="1" begin="14" end="14" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="14" rwaccess="R"/> 
		<bitfield id="XMAX_SHDW3FULL" width="1" begin="13" end="13" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="13" rwaccess="R"/> 
		<bitfield id="XAQCTLB_SHDW3FULL" width="1" begin="12" end="12" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="12" rwaccess="R"/> 
		<bitfield id="XAQCTLA_SHDW3FULL" width="1" begin="11" end="11" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="11" rwaccess="R"/> 
		<bitfield id="CMPD_SHDW3FULL" width="1" begin="10" end="10" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="10" rwaccess="R"/> 
		<bitfield id="CMPC_SHDW3FULL" width="1" begin="9" end="9" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="9" rwaccess="R"/> 
		<bitfield id="XTBPRD_SHDW3FULL" width="1" begin="8" end="8" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="8" rwaccess="R"/> 
		<bitfield id="XCMP8_SHDW3FULL" width="1" begin="7" end="7" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="7" rwaccess="R"/> 
		<bitfield id="XCMP7_SHDW3FULL" width="1" begin="6" end="6" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="6" rwaccess="R"/> 
		<bitfield id="XCMP6_SHDW3FULL" width="1" begin="5" end="5" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="5" rwaccess="R"/> 
		<bitfield id="XCMP5_SHDW3FULL" width="1" begin="4" end="4" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="4" rwaccess="R"/> 
		<bitfield id="XCMP4_SHDW3FULL" width="1" begin="3" end="3" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="3" rwaccess="R"/> 
		<bitfield id="XCMP3_SHDW3FULL" width="1" begin="2" end="2" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="2" rwaccess="R"/> 
		<bitfield id="XCMP2_SHDW3FULL" width="1" begin="1" end="1" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="1" rwaccess="R"/> 
		<bitfield id="XCMP1_SHDW3FULL" width="1" begin="0" end="0" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="0" rwaccess="R"/>
	</register>
	<register id="CONTROLSS_G1_EPWM30_XCMP1_ACTIVE" acronym="CONTROLSS_G1_EPWM30_XCMP1_ACTIVE" offset="0x600" width="32" description="Additional Compare 1 Active Register">
		<bitfield id="XCMP1_ACTIVE" width="16" begin="31" end="16" resetval="0x0" description="XCMP1_ACTIVE Register The value in the XCMP1_ACTIVE register is loaded into CMPA/B [shadow/active] registers when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP1HR_ACTIVE" width="16" begin="15" end="0" resetval="0x0" description="XCMP1HR_ACTIVE Register  The value in the XCMP1HR_ACTIVE register is loaded into CMPA/BHR [shadow/active] registers when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM30_XCMP2_ACTIVE" acronym="CONTROLSS_G1_EPWM30_XCMP2_ACTIVE" offset="0x604" width="32" description="Additional Compare 2 Active Register">
		<bitfield id="XCMP2_ACTIVE" width="16" begin="31" end="16" resetval="0x0" description="XCMP2_ACTIVE Register The value in the XCMP2_ACTIVE register is loaded into CMPA/B [shadow/active] registers when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP2HR_ACTIVE" width="16" begin="15" end="0" resetval="0x0" description="XCMP2HR_ACTIVE Register  The value in the XCMP2HR_ACTIVE register is loaded into CMPA/BHR [shadow/active] registers when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM30_XCMP3_ACTIVE" acronym="CONTROLSS_G1_EPWM30_XCMP3_ACTIVE" offset="0x608" width="32" description="Additional Compare 3 Active Register">
		<bitfield id="XCMP3_ACTIVE" width="16" begin="31" end="16" resetval="0x0" description="XCMP3_ACTIVE Register The value in the XCMP3_ACTIVE register is loaded into CMPA/B [shadow/active] registers when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP3HR_ACTIVE" width="16" begin="15" end="0" resetval="0x0" description="XCMP3HR_ACTIVE Register  The value in the XCMP3HR_ACTIVE register is loaded into CMPA/BHR [shadow/active] registers when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM30_XCMP4_ACTIVE" acronym="CONTROLSS_G1_EPWM30_XCMP4_ACTIVE" offset="0x60C" width="32" description="Additional Compare 4 Active Register">
		<bitfield id="XCMP4_ACTIVE" width="16" begin="31" end="16" resetval="0x0" description="XCMP4_ACTIVE Register The value in the XCMP4_ACTIVE register is loaded into CMPA/B [shadow/active] registers when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP4HR_ACTIVE" width="16" begin="15" end="0" resetval="0x0" description="XCMP4HR_ACTIVE Register  The value in the XCMP4HR_ACTIVE register is loaded into CMPA/BHR [shadow/active] registers when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM30_XCMP5_ACTIVE" acronym="CONTROLSS_G1_EPWM30_XCMP5_ACTIVE" offset="0x610" width="32" description="Additional Compare 5 Active Register">
		<bitfield id="XCMP5_ACTIVE" width="16" begin="31" end="16" resetval="0x0" description="XCMP5_ACTIVE Register The value in the XCMP5_ACTIVE register is loaded into CMPA/B [shadow/active] registers when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP5HR_ACTIVE" width="16" begin="15" end="0" resetval="0x0" description="XCMP5HR_ACTIVE Register  The value in the XCMP5HR_ACTIVE register is loaded into CMPA/BHR [shadow/active] registers when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
